# 期货合约代码与乘数对应字典
contract_multipliers = {
    # 国债
    'T': 10000, 'TF': 10000, 'TL': 10000, 'TS': 20000,
    # 金属
    'AG': 15, 'AL': 5, 'AU': 1000, 'CU': 5, 'NI': 1, 'PB': 5, 'SN': 1, 'ZN': 5, 'AO': 20,
    # 能源化工
    'BC': 5, 'BU': 10, 'EB': 5, 'EG': 10, 'FU': 10, 'L': 5, 'LU': 10, 'MA': 10, 'PF': 5,
    'PG': 20, 'PP': 5, 'PX': 5, 'RU': 10, 'SC': 1000, 'TA': 5, 'UR': 20, 'V': 5, 'BR': 5,
    'PR': 15,
    # 农产品
    'A': 10, 'AP': 10, 'B': 10, 'C': 10, 'CF': 5, 'CS': 10, 'JD': 10, 'M': 10, 'OI': 10,
    'P': 10, 'PK': 5, 'RM': 10, 'SR': 10, 'Y': 10, 'LH': 16,
    # 工业品
    'CJ': 5, 'FG': 20, 'HC': 10, 'I': 100, 'J': 100, 'JM': 60, 'LG': 90, 'NR': 10,
    'RB': 10, 'SA': 20, 'SF': 5, 'SM': 5, 'SP': 10, 'SS': 5, 'LC': 1, 'SH': 30, 'SI': 5,
    # 期指
    'IF': 300,
    # 其他 
    'EC': 50,
}
#交易所列表
exchanges = ["CFFEX", "INE", "CZCE", "DCE", "SHFE", "GFEX"]


